app/controllers/greetings_controller.rb

  def random
    greeting = Message.order('RANDOM()').first
---
SELECT "messages".* FROM "messages" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]